In [4]:
import pandas as pd

# DataFrame de Exemplo

data = {'Empresa': ['Google', 'Google', 'Microsoft', 'Microsoft', 'FaceBook', 'FaceBook'],
        'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Venda': [200, 120, 340, 124, 243, 350]}

In [5]:
df = pd.DataFrame(data)

In [6]:
df

     Empresa     Nome  Venda
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   FaceBook     Carl    243
5   FaceBook    Sarah    350

In [12]:
# Gerando o Agrupamento por Empresa
group = df.groupby('Empresa')

In [14]:
# Método de soma do agrupamento
group.sum()

           Venda
Empresa
FaceBook     593
Google       320
Microsoft    464

In [15]:
# Método para gerar a Média
group.mean()

           Venda
Empresa
FaceBook   296.5
Google     160.0
Microsoft  232.0

In [16]:
# Método Describe aponta uma série de opcoes
group.describe()

          Venda
          count   mean         std    min     25%    50%     75%    max
Empresa
FaceBook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [18]:
# Método Count
group.count()

           Nome  Venda
Empresa
FaceBook      2      2
Google        2      2
Microsoft     2      2

In [21]:
# Método Group By por Nome
group = df.groupby('Nome')

In [22]:
group.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [24]:
group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64